In [1]:
import pandas
pandas.__version__

'2.0.0'

In [6]:
#Creando data frames 
import pandas as pd
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)


df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [13]:
df["Age"]

0    22
1    35
2    58
Name: Age, dtype: int64

In [19]:
#Creando series desde 0
ages = pd.Series([22, 35, 58], name="Age")
ages
cliente = pd.Series(["si", "no" , "no"], name="Cliente")
cliente

df["Age"].max() #Sacando la maxima edad del dataframe
ages.max() #Sacando la edad maxima de la serie

#el metodo describe() nos da una rapida vista a los datos numericos del data frame 
df.describe()

             Age
count   3.000000
mean   38.333333
std    18.230012
min    22.000000
25%    28.500000
50%    35.000000
75%    46.500000
max    58.000000

In [30]:
#Instalando Openpyxl
pip install --user -U openpyxl==2.6.2 
#Para actualizar Openpyxl
#python.exe -m pip install --upgrade pip

Note: you may need to restart the kernel to use updated packages.

ERROR: Can not perform a '--user' install. User site-packages are not visible in this virtualenv.

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [6]:
import pandas as pd

#import openpyxl

#Cargar archivos csv
titanic = pd.read_csv("titanic.csv")
titanic

titanic.head(8) #Muestra las primeras 8 filas
titanic.dtypes #Muestra como panda interpreta los tipos de cada columna


#Crea un archivo de excel con el data frame
#titanic.to_excel("titanic.xlsx", sheet_name="passengers", index=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
import openpyxl

ModuleNotFoundError: No module named 'openpyxl'